app/controllers/bills_controller.rb

	def index

		@bill = Bill.all
---
SELECT "bills".* FROM "bills"

	def create

		@bill = Bill.new(bill_params)

		if @bill.save
---
INSERT INTO "bills" ("linenumber", "quantity", "invoice_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["linenumber", "00002"], ["quantity", "2"], ["invoice_id", 1], ["created_at", 2016-11-01 07:32:51 UTC], ["updated_at", 2016-11-01 07:32:51 UTC]]

	def edit

		@bill = Bill.find(params[:id])
---
SELECT  "bills".* FROM "bills" WHERE "bills"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]

	def update
		@bill = Bill.find(params[:id])

		if @bill.update(bill_params)
---
SELECT  "bills".* FROM "bills" WHERE "bills"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "bills" SET "quantity" = ?, "updated_at" = ? WHERE "bills"."id" = ?  [["quantity", "3"], ["updated_at", 2016-11-01 06:01:56 UTC], ["id", 1]]