app/controllers/customers_controller.rb

	def index

		@customer = Customer.all
---
SELECT "customers".* FROM "customers"

	def create

		@customer = Customer.new(customer_params)

		if @customer.save
---
INSERT INTO "customers" ("custABN", "first_name", "last_name", "email", "address", "phone", "pincode", "password", "confirmation", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

	def update
		@customer = Customer.find(params[:id])

		if @customer.update(customer_params)
---
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "customers" SET "address" = ?, "password" = ?, "confirmation" = ?, "updated_at" = ? WHERE "customers"."id" = ?  [["address", "sikar, rajasthan"], ["password", ""], ["confirmation", ""], ["updated_at", 2016-10-28 12:46:19 UTC], ["id", 4]]