app/controllers/invoices_controller.rb

	def index

		@invoice = Invoice.all
---
SELECT "invoices".* FROM "invoices"

	def create

		@invoice = Invoice.new(invoice_params)

		if @invoice.save
---
INSERT INTO "invoices" ("custABN", "customer_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["custABN", "0002"], ["customer_id", 2], ["created_at", 2016-11-01 09:17:38 UTC], ["updated_at", 2016-11-01 09:17:38 UTC]]

	def edit

		@invoice = Invoice.find(params[:id])
---
SELECT  "invoices".* FROM "invoices" WHERE "invoices"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]

	def update
		@invoice = Invoice.find(params[:id])

		if @invoice.update(invoice_params)
---
SELECT  "invoices".* FROM "invoices" WHERE "invoices"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "invoices" SET "created" = ?, "updated_at" = ? WHERE "invoices"."id" = ?  [["created", Tue, 01 Nov 2016], ["updated_at", 2016-11-01 06:28:51 UTC], ["id", 1]]