app/controllers/items_controller.rb

	def index

		@item = Item.all
---
SELECT "items".* FROM "items"

	def create

		@item = Item.new(item_params)

		if @item.save
---
INSERT INTO "items" ("name", "description", "price", "bill_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Redmi 3S"], ["description", "good mobile with new accessory"], ["price", "7000"], ["bill_id", 1], ["created_at", 2016-11-01 07:34:08 UTC], ["updated_at", 2016-11-01 07:34:08 UTC]]

	def update
		@item = Item.find(params[:id])

		if @item.update(item_params)
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "items" SET "cart_id" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["cart_id", 1], ["updated_at", 2016-11-03 07:21:27 UTC], ["id", 1]]