app/controllers/line_items_controller.rb

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", 2016-11-03 06:16:43 UTC], ["updated_at", 2016-11-03 06:16:43 UTC]]
INSERT INTO "line_items" ("item_id", "cart_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["item_id", 2], ["cart_id", 4], ["created_at", 2016-11-03 06:16:43 UTC], ["updated_at", 2016-11-03 06:16:43 UTC]]
---
  def create
    @line_item = LineItem.new(line_item_params)

@cart = current_cart
item = Item.find(params[:item_id])
@line_item = @cart.line_items.build(item: item)




    respond_to do |format|
      if @line_item.save