app/controllers/paymodes_controller.rb

	def index
		@paymode = Paymode.all
---
SELECT "paymodes".* FROM "paymodes"

	def create

		@paymode = Paymode.new(paymode_params)

		if @paymode.save
---
INSERT INTO "paymodes" ("name", "card_holder_name", "cardnumber", "validity", "CCV", "order_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)