app/controllers/store_controller.rb

SELECT "items".* FROM "items" ORDER BY "items"."name" ASC
---
  def index
  	@item = Item.order(:name)